Repository: SaidmurodTurdiyevDeveloper/hemis_demo
Catalog: lib/l10n/app_*.arb
Languages: ru, uz, uz_cyrl

# hames
source: HAMIS
ru: ҲАМИС
uz_cyrl: ҲАМИС

# uzbek
source: Uzbek language
ru: Узбекский язык
uz: O‘zbek tili
uz_cyrl: Ўзбек тили

# uzbek_cyrl
source: Uzbek language
ru: Узбекский язык
uz: O‘zbek tili
uz_cyrl: Ўзбек тили

# russian
source: Russian language
ru: Русский язык
uz: Rus tili
uz_cyrl: Рус тили

# english
source: English language
ru: Английский язык
uz: Ingliz tili
uz_cyrl: Инглиз тили

# choose_language
source: Choose a language
ru: Выберите язык
uz: Tilni tanlang
uz_cyrl: Тилни танланг

# choose_language_continue
source: Choose your preferred language to continue
ru: Выберите удобный язык, чтобы продолжить
uz: O’zingizga qulay tilni tanlab davom eting
uz_cyrl: Ўзингизга қулай тилни танлаб давом этинг

source: Next
ru: Далее
uz: Keyingisi
uz_cyrl: Кейингиси

# intro_first
source: Take a step toward life-changing knowledge!
ru: Сделайте шаг к знаниям, которые изменят вашу жизнь!
uz: Hayotingizni o‘zgartiruvchi bilimlarga qadam qo‘ying!
uz_cyrl: Ҳаётингизни ўзгартирувчи билимларга қадам қўйинг!

# intro_first_description
source: With us, you can easily and interactively learn modern skills.
ru: С нами вы легко и интерактивно освоите современные навыки.
uz: Biz bilan siz zamonaviy ko‘nikmalarni oson va interaktiv tarzda o‘rganasiz.
uz_cyrl: Биз билан сиз замонавий кўникмаларни осон ва интерактив тарзда ўрганасиз.

# intro_second
source: Personal development â€” now in your mobile app
ru: Личностное развитие — теперь в вашем мобильном приложении
uz: Shaxsiy rivojlanish — endi mobil ilovangizda
uz_cyrl: Шахсий ривожланиш — энди мобил иловангизда

# intro_second_description
source: All the lessons you need for self-growth in one place.
ru: Все необходимые уроки для самосовершенствования — в одном месте.
uz: O‘z ustingizda ishlash uchun sizga kerak bo‘lgan barcha darslar bir joyda.
uz_cyrl: Ўз устиңизда ишлаш учун сизга керак бўлган барча дарслар бир жойда.

# intro_third
source: Learn anytime, anywhere
ru: Учитесь в любое время и в любом месте
uz: Istalgan joyda, istalgan vaqtda o‘rganing
uz_cyrl: Исталган жойда, исталган вақтда ўрганинг

# intro_third_description
source: Access education 24/7 through the internet. Now, learning is up to you!
ru: Получайте образование 24/7 через интернет. Теперь всё зависит от вас!
uz: Internet orqali 24/7 ta’lim olish imkoni. Endi o‘rganish sizga bog‘liq!
uz_cyrl: Интернет орқали 24/7 таълим олиш имкони. Энди ўрганиш сизга боғлиқ!

source: Skip
ru: Пропустить
uz: O‘tkazib yuborish
uz_cyrl: Ўтказиб юбориш

source: Login
ru: Войти
uz: Kirish
uz_cyrl: Кириш

source: Search
ru: Поиск
uz: Qidiring
uz_cyrl: Қидиринг

source: All universities
ru: Все высшие учебные заведения
uz: Barcha Oliy ta’lim muassasalari
uz_cyrl: Барча Олий таълим муассасалари

source: Choose university
ru: Выберите университет
uz: Universitetni tanlang
uz_cyrl: Университетни танланг

# choose_your_university
source: Select the university you are studying at
ru: Выберите вуз, в котором вы учитесь
uz: Siz o‘qiyotgan Oliy ta’lim muassasasini tanlang
uz_cyrl: Сиз ўқиётган Олий таълим муассасасини танланг

# enter_app
source: LOGIN TO THE APP
ru: ВОЙТИ В ПРИЛОЖЕНИЕ
uz: ILOVAGA KIRISH
uz_cyrl: ИЛОВАГА КИРИШ

# enter_id_and_pass
source: Please enter your student ID and password
ru: Пожалуйста, введите ваш студенческий ID и пароль
uz: Iltimos talaba ID si va parolingizni kiriting
uz_cyrl: Илтимос талаба ID си ва паролингизни киритинг

# student_id_hint
source: Enter your student ID
ru: Введите ваш студенческий ID
uz: Talaba ID yingizni kiriting
uz_cyrl: Талаба ID ингизни киритинг

# student_password_hint
source: Enter your password
ru: Введите пароль
uz: Parolni kiriting
uz_cyrl: Паролни киритин

source: Remember me
ru: Запомнить меня
uz: Eslab qolish
uz_cyrl: Эслаб қолиш

source: Forgot password?
ru: Забыли пароль?
uz: Parolni unutdingizmi?
uz_cyrl: Паролни унутдингизми?

# empty_student_id_error
source: ID is required
ru: ID не введён
uz: Id kiritilmagan
uz_cyrl: ID киритилмаган

# only_digits_rror
source: ID must contain digits only
ru: ID должен состоять только из цифр
uz: ID faqat raqamlardan iborat bo‘lishi kerak
uz_cyrl: ID фақат рақамлардан иборат бўлиши керак

# empty_password_error
source: Password is required
ru: Пароль не введён
uz: Password kiritilmagan
uz_cyrl: Парол киритилмаган

# min_password_error
source: Password is incomplete
ru: Пароль неполный
uz: Password to`liq emas
uz_cyrl: Парол тўлиқ эмас
